Repository: plone/plone.volto
Catalog: src/plone/volto/locales/*/LC_MESSAGES/plone.volto.po
Languages: de, es, eu, pt_br

source: A site migrated to Volto in this Plone backend will still be accessible through the Plone Classic User Interface but with limited functionality. The core content types will have all their GUI RichText fields replaced by the blocks behavior for the composition of the main content. So after migration you can only edit this content using the Volto UI.
es: Un sitio migrado a Volto en este backend de Plone seguirá siendo accesible a través de la interfaz de usuario de Plone Classic, pero con una funcionalidad limitada. Los tipos de contenido principal tendrán todos sus campos de texto enriquecido de la GUI reemplazados por el comportamiento de bloques para la composición del contenido principal. Por lo tanto, después de la migración, solo puede editar este contenido mediante la interfaz de usuario de Volto.

source: Adds kicker field (text to be shown above the headline)
es: Agrega un campo de inicio (el texto se mostrará encima del título)

source: Advanced settings
es: Ajustes avanzados

source: Collections and Pages that are the default-page of a Folder will be applied on the migrated Folderish Page. For Collections that means adding a listing block with the same query. This only happens if you also you migrate Folders to Folderish Pages.
es: Las colecciones y páginas que son la página predeterminada de una carpeta se aplicarán en la página de carpeta migrada. En el caso de las colecciones, eso significa agregar un bloque de listado con la misma consulta. Esto solo sucede si también migra carpetas a páginas de carpetas.

source: Collections are migrated to Pages with Listing Blocks configured like the Collection.
es: Las colecciones se migran a páginas con bloques de listado configurados como la colección.

source: Configures a new site with Volto and standard content types.
es: Configura un nuevo sitio con Volto y tipos de contenido estándar.

source: Configures the Plone backend to work with Volto.
es: Configura Plone para funcionar con Volto.

source: Content Types to handle
es: Tipos de contenido que se van a manejar

source: Convert to Slate (default)
es: Convertir a Slate (predeterminado)

source: Convert to draftjs (a old format used until Volto 15)
es: Convertir a draftjs (un formato antiguo utilizado hasta Volto 15)

source: Default Pages of Folders are merged with the Folderish Pages that replace the Folder wherever that is possible. This works well with Pages and Collections where the text and/or query are added to the folderish page that replaces the Folder.
es: Las páginas predeterminadas de las carpetas se combinan con las páginas de carpetas que reemplazan a la carpeta siempre que sea posible. Esto funciona bien con páginas y colecciones en las que el texto y/o la consulta se agregan a la página en forma de carpeta que reemplaza a la carpeta.

source: Deprecated (use volto.kicker instead)
es: Obsoleto (use volto.kicker en su lugar)

source: Example
es: Ejemplo

source: Head title field
de: Kopftitel Feld
es: Campo de título de cabecera
eu: Goiburuko izenburuaren eremua
pt_br: Campo Título de cabeçalho

source: Here you can prepare this site for Volto.
es: Aquí puedes preparar este sitio para Volto.

source: Install the package <code>plone.volto</code> and <code>plone.restapi</code>.
es: Instale el paquete <code>plone.volto</code> y <code>plone.restapi</code>.

source: Installation profile for the Volto distribution
es: Perfil de instalación para la distribución Volto

source: It is recommendet to use the default settings but here you can disable some of the migration-steps.
es: Se recomienda utilizar la configuración predeterminada, pero aquí puede deshabilitar algunos de los pasos de migración.

source: Kicker field
es: Campo de título de cabecera

source: Migrate
es: Migrar

source: Migrate Folders to Folderish Pages
es: Migrar carpetas a páginas en carpetas

source: Migrate Richtext to Slate Block
es: Migrar texto enriquecido a bloque de Slate

source: Migrate default Pages into the Folderish Pages if possible
es: Migre las páginas predeterminadas a las páginas de carpetas si es posible

source: Migrate text from RichText-fields to text in the Volto Editor
es: Migrar texto de campos de texto enriquecido a texto en el Editor de Volto

source: Migrate to Volto
es: Migrar a Volto

source: Navigation title
de: Navigationstitel
es: Título de la navegación
eu: Nabigazioaren izenburua
pt_br: Título de navegação

source: Navigation title used in sections, menus and doormats
de: Navigationstitel der in der Navigation, Brotkrumen und Auflistungen verwendet wird
es: Título de la navegación utilizado en secciones, menús y acordeones
eu: Atal, menu eta akordeoietan erabiliko den nabigazioaren izenburua
pt_br: Título de navegação usado em seções, menus e rodapés

source: Pages, News Items, and Events are made folderish. That means they can contain other content, such as Images or Pages.
es: Las páginas, las noticias y los eventos se convierten en carpetas. Eso significa que pueden contener otro contenido, como imágenes o páginas.

source: Preview Image
de: Vorschaubild
es: Imagen
eu: Irudia
pt_br: Imagem de Pré-visualização

source: Preview Image Link
es: Enlace de imagen de vista previa
pt_br: Imagem de Pré-visualização de Link

source: Preview image for listings
de: Vorschaubild für Auflistungen
es: Imagen para listados
eu: Zerrendetan erabiliko den irudia
pt_br: Imagem de Pré-visualização para listagens

source: Preview image for listings based on links
es: Vista previa de la imagen de los listados basados en enlaces
pt_br: Imagem de Pré-visualização para listagens baseada em links

source: Purge Richtext-fields after migrating to Slate
es: Purgar campos de texto enriquecido después de migrar a Slate

source: Purge old Richtext-fields after migrating to Volto blocks
es: Purgar los antiguos campos de texto enriquecido después de migrar a los bloques Volto

source: Requirements for this migration wizard
es: Requisitos para este asistente de migración

source: Special test fixture for coresandbox use cases
es: Accesorio de prueba especial para casos de uso de coresandbox
pt_br: Teste fixture especial para casos de uso do codesandbox

source: Special test fixture for multilingual use case
de: Text Fixture für Mehrsprachigkeit
es: Perfil especial para configurar los tests de un sitio multilingüe
eu: Webgune eleanitzetan erabiltzeko profila
pt_br: Teste fixture especial para caso de uso multilíngue

source: The HTML of RichText fields (previously edited using TinyMCE) is converted into Volto blocks so you can edit it in Volto.
es: El HTML de los campos de RichText (previamente editados con TinyMCE) se convierte en bloques de Volto para que pueda editarlo en Volto.

source: The RichtextValue objects will be removed from the migrated objects. The old fields (from the behavior plone.volto) are no longer available.
es: Los objetos RichtextValue se quitarán de los objetos migrados. Los campos antiguos (del comportamiento plone.volto) ya no están disponibles.

source: The migration requires a service to run. See https://github.com/plone/blocks-conversion-tool for details.
es: La migración requiere que se ejecute un servicio. Consulte https://github.com/plone/blocks-conversion-tool para obtener más detalles.

source: To migrate RichText to Volto Blocks you need to have <code>blocks-conversion-tool</code> running on an accessible URL. The easiest way to have that running on your machine is: <code>docker run -it -p 5000:5000 plone/blocks-conversion-tool:latest</code>. More for options read <a href="https://github.com/plone/blocks-conversion-tool">https://github.com/plone/blocks-conversion-tool</a>.
es: Para migrar RichText a Volto Blocks, debe tener <code>blocks-conversion-tool</code> una URL accesible. La forma más fácil de tenerlo funcionando en su máquina es: <code>docker run -it -p 5000:5000 plone/blocks-conversion-tool:latest</code>. Para conocer más opciones, lea <a href="https://github.com/plone/blocks-conversion-tool">https://github.com/plone/blocks-conversion-tool</a>.

source: URL of blocks-conversion-tool.
es: URL de blocks-conversion-tool.

source: URL of blocks-conversion-tool. The migration requires a service to run. See https://github.com/plone/blocks-conversion-tool for details.
es: URL de blocks-conversion-tool. La migración requiere que se ejecute un servicio. Consulte https://github.com/plone/blocks-conversion-tool para obtener más detalles.

source: Uninstalls the plone.volto add-on.
de: Deinstalliert die Erweiterung plone.volto
es: Desinstalar plone.volto.
eu: plone.volto kendu
pt_br: Desintalar o complemento plone.volto.

source: Volto Frontend (plone.volto)
es: Frontal Volto (plone.volto)

source: Volto Frontend (plone.volto): Uninstall
es: Frontal Volto (plone.volto): desinstalar

source: Volto Settings
es: Configuración de Volto

source: Volto is a React-based frontend for Plone. It is the default UI for Plone 6. Volto is a separate server-side application.
es: Volto es un frontend basado en React para Plone. Es la interfaz de usuario predeterminada para Plone 6. Volto es una aplicación separada del lado del servidor.

source: Volto needs to run continuously alongside the current Plone backend service from which you access this wizard. The Volto server performs initial server-side rendering (SSR) of the React application for pages. It also delivers the JavaScript frontend to your browser. Without a Volto frontend prepared for this website and the means to host it, continuing this migration makes no sense! Read the <a href="https://6.docs.plone.org/volto/index.html">Volto Frontend documentation</a> for more information.
es: Volto debe ejecutarse continuamente junto con el servicio backend actual de Plone desde el que se accede a este asistente. El servidor Volto realiza la representación inicial del lado del servidor (SSR) de la aplicación React para las páginas. También entrega la interfaz de JavaScript a su navegador. Sin un frontend de Volto preparado para este sitio web y los medios para alojarlo, ¡continuar con esta migración no tiene sentido! Lea la <a href="https://6.docs.plone.org/volto/index.html">documentación de Volto Frontend</a> para obtener más información.

source: Warning
es: Advertencia

source: What do you need for Volto?
es: ¿Qué necesitas para Volto?

source: What is Volto?
es: ¿Qué es Volto?

source: What will happen?
es: ¿Qué pasará?

source: When you click on "Migrate to Volto" at the end of the form, the following things will happen:
es: Al hacer clic en "Migrar a Volto" al final del formulario, sucederán las siguientes cosas:

source: description_available_languages
es: Los idiomas a los que debe traducirse el sitio.
pt_br: Idiomas nos quais o site deve ser traduzível.

source: heading_available_languages
es: Idiomas disponibles
pt_br: Idiomas disponíveis

source: help_frontend_domain
es: Se utiliza para reescribir las URL enviadas en el correo electrónico de restablecimiento de contraseña por Plone.

source: help_kicker
es: El título de cabecera se muestra encima del título en los bloques teaser.

source: help_previewimage
de: Bild einfügen welches in Auflistungen und Anreißer-Blöcken verwendet wird.
es: Introduzca la imagen que se utilizará en los listados y otros bloques.
eu: Kargatu zerrendetan eta destakatuen blokeetan defektuz erabiliko den irudia
pt_br: Inserir uma imagem que será utilizada em blocos de listagem e teaser

source: label_frontend_domain
es: Dominio frontend

source: label_kicker
es: Título de cabecera

source: label_previewimage
de: Vorschaubild
es: Imagen
eu: Irudia
pt_br: Imagem de Pré-visualização

source: plone.volto coresandbox Cypress tests fixtures
es: prueba los accesorios Cypress plone.volto coresandbox

source: plone.volto multilingual Cypress tests fixtures
es: prueba los accesorios Cypress plone.volto multilingüe
eu: plone.volto eleanitzaren Cypress testen konfigurazioa

source: volto_backend_warning
es: Ha accedido al backend de Plone a través de su frontend Classic UI.

source: volto_backend_warning_link
es: Si desea utilizar la nueva interfaz Volto de Plone: <ul> <li>Instale Volto, si aún no está instalado.</li> <li>Inicie Volto, si aún no está iniciado.</li> <li>Visite la interfaz de Volto.</li> </ul> Para obtener más información, lea la documentación sobre cómo <a href='https://6.docs.plone.org/install/create-project-cookieplone.html'>Instalar Plone desde sus paquetes</a> y consulte la documentación completa de Volto <a href='https://6.docs.plone.org/volto/index.html'>Interfaz</a>.

source: Adds Head title field
de: Kopftitel Feld hinzufügen
eu: Goiburuko izenburua gehitu
pt_br: Adiciona campo Título de cabeçalho

source: Configures the Plone backend to work with Volto, the new default frontend for Plone 6.
de: Konfiguration des Plone Backends für Volto, dem neuen Standard-Frontend von Plone 6
eu: Plone Voltorekin funtzionatzeko konfiguratzen du, Plone 6rako Frontend berria.
pt_br: Configura o backend do Plone para funcionar com o Volto, o novo frontend padrão do Plone 6.

source: Creates a default page for the site
de: Erstellt eine Startseite für die Webseite
eu: Atariaren defektuzko orri berria sortzen du
pt_br: Cria uma página padrão para o site

source: Creates a default page for the site using (legacy) draftJS blocks
pt_br: Cria uma página padrão para o site usando blocos draftJS (legado)

source: Creates a default page for the site using slate blocks
pt_br: Cria uma página padrão para o site usando blocos slate

source: Plone 6 Frontend (Default content on homepage with slate blocks)
pt_br: Plone 6 Frontend (conteúdo padrão na página inicial com blocos draftJS)

source: Plone 6 Frontend (Default content on homepage)
de: Plone 6 Frontend (Standard Inhalte)
eu: Plone 6 Frontenda (hasiera orria defektuzko edukiarekin)
pt_br: Plone 6 Frontend (conteúdo padrão na página inicial)

source: Plone 6 Frontend (plone.volto): uninstall
de: Plone 6 Frontend (plone.volto): Deinstallation
eu: Plone 6 Frontenda (plone.volto): kendu
pt_br: Plone 6 Frontend (plone.volto): desinstalar

source: Preview image caption
de: Legende zum Vorschaubild
eu: Irudi-oina
pt_br: Legenda da Imagem de Pré-visualização

source: Special requirements and setup for demo site
de: Setup für Demo Website
eu: Demo webgunea konfiguratzeko profil berezia
pt_br: Requisitos especiais e configuração para o site de demonstração

source: Specific profile for re-adding the richtext behavior
de: Profil um das Rich-Text Behavior erneut hinzuzufügen
eu: Testu aberatseko portaera gehitzeko profila
pt_br: Profile específico para re-adicionar o comportamento de texto rico

source: help_head_title
pt_br: O título de cabeçalho é exibido acima do título nos teasers

source: label_head_title
pt_br: Título de cabeçalho

source: plone.volto demo special requirements
eu: plone.volto demoren konfigurazio berezia
pt_br: Requisitos especiais para a demonstração do plone.volto

source: Header title
de: Kopftitel
eu: Goiburuko izenburua

source: Header title should consist of year and number of the report
de: Kopftitel sollte aus Jahr und Nummer des Berichts bestehen
eu: Goiburukoan erabiliko den izenburua

source: Plone 6 Frontend (plone.volto)
eu: Plone 6 Frontenda (plone.volto)

source: plone.volto p51 profile
eu: plone.volto p51 profila
